In [1]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

Intro To DataFrames

In [2]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]], columns=["A", "B", "C"], index=["r1", "r2", "r3", "r4"])

df.head(2)

    A  B  C
r1  1  2  3
r2  4  5  6

In [3]:
df.tail(3)

     A   B   C
r2   4   5   6
r3   7   8   9
r4  10  11  12

In [4]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [5]:
df.index.tolist()

['r1', 'r2', 'r3', 'r4']

In [6]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, r1 to r4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [7]:
df.shape #jumlah (baris, kolom)

(4, 3)

In [8]:
df.size #jumlah elemen yang ada dalam dataframe

12

In [9]:
df.nunique() #jumlah nilai unik perkolom

A    4
B    4
C    4
dtype: int64

In [10]:
df['A'].unique() #Menampilkan nilai unik pada kolom A -> output berupa array NumPy

array([ 1,  4,  7, 10])

In [11]:
df

     A   B   C
r1   1   2   3
r2   4   5   6
r3   7   8   9
r4  10  11  12

Loading in DataFrame from Files

In [12]:
coffee = pd.read_csv('./data/coffee.csv')
bios = pd.read_csv('./data/bios.csv')
result = pd.read_parquet('./data/results.parquet')
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name="results")

Accessing Data with Pandas

In [13]:
print(coffee)
display(coffee)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [14]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [15]:
coffee.tail(2)

       Day Coffee Type  Units Sold
12  Sunday    Espresso          45
13  Sunday       Latte          35

In [16]:
coffee.sample(3)

         Day Coffee Type  Units Sold
11  Saturday       Latte          35
7   Thursday       Latte          30
10  Saturday    Espresso          45

In [17]:
#loc
#Coffee.loc[Rows, Columns]
coffee.loc[1]

Day            Monday
Coffee Type     Latte
Units Sold         15
Name: 1, dtype: object

In [18]:
#indexing loc tergantung label indexnya
new_coffee = coffee.set_index("Day")
new_coffee.loc[["Monday","Sunday"]]

       Coffee Type  Units Sold
Day
Monday    Espresso          25
Monday       Latte          15
Sunday    Espresso          45
Sunday       Latte          35

In [19]:
coffee.loc[5:9, ["Day", "Units Sold"]]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45
9     Friday          35

In [20]:
#indexing iloc tergantung posisi baris
coffee.iloc[0:5, [0,2]]

         Day  Units Sold
0     Monday          25
1     Monday          15
2    Tuesday          30
3    Tuesday          20
4  Wednesday          35

In [21]:
coffee.loc[5:9, ["Day", "Units Sold"]]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45
9     Friday          35

In [22]:
coffee.loc[[0,10,12]]

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
10  Saturday    Espresso          45
12    Sunday    Espresso          45

In [23]:
#Setting values
coffee.loc[0, "Units Sold"] = 5
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso           5
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [24]:
#Optimized way to get single values (.at & .iat)
coffee.at[0, "Units Sold"]
coffee.iat[8,2]

np.int64(5)

np.int64(45)

In [25]:
#Getting columns
coffee.Day[0:4]

0     Monday
1     Monday
2    Tuesday
3    Tuesday
Name: Day, dtype: object

In [26]:
coffee["Day"]

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [27]:
#Sort Values
coffee.sort_values(["Units Sold"], ascending=False) #ascening : naik

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15
0      Monday    Espresso           5

In [28]:
coffee.sort_values(["Day", "Units Sold"], ascending=[1,0])

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
9      Friday       Latte          35
1      Monday       Latte          15
0      Monday    Espresso           5
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35
6    Thursday    Espresso          40
7    Thursday       Latte          30
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25

In [29]:
#Iterate over dataframe with for loop
for index, row in coffee.iloc[7:10].iterrows(): #method iterrows digunakan untuk mengiterasi stiap baris dalam DataFrame
    print(index)
    print(row)
    print("Coffee type of row:", row["Coffee Type"])

7
Day            Thursday
Coffee Type       Latte
Units Sold           30
Name: 7, dtype: object
Coffee type of row: Latte
8
Day              Friday
Coffee Type    Espresso
Units Sold           45
Name: 8, dtype: object
Coffee type of row: Espresso
9
Day            Friday
Coffee Type     Latte
Units Sold         35
Name: 9, dtype: object
Coffee type of row: Latte

Filtering Data

In [30]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [31]:
bios.loc[bios["height_cm"] > 220]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Dueñas,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN

In [32]:
bios.loc[bios["height_cm"] > 220, ["name", 'height_cm']]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [33]:
#short-hand syntax without .loc
bios[bios['height_cm'] > 220][['name', 'height_cm']]

                   name  height_cm
5673     Gunther Behnke      221.0
5781     Tommy Burleson      223.0
6978    Arvydas Sabonis      223.0
89070          Yao Ming      226.0
89075    Roberto Dueñas      221.0
120266     Zhang Zhaoxu      221.0

In [42]:
#Multiple filter conditions
bios[(bios['height_cm'] > 215) & (bios['born_country'] == "USA")][['name', 'height_cm', 'born_country']]

                    name  height_cm born_country
5781      Tommy Burleson      223.0          USA
6722    Shaquille O'Neal      216.0          USA
6937      David Robinson      216.0          USA
123850    Tyson Chandler      216.0          USA

In [44]:
#Gunakan .isin([...]) untuk memfilter beberapa nilai dalam kolom
bios[(bios['height_cm'] > 215) & (bios['born_country'].isin(["USA", "FRA"]))][['name', 'height_cm', 'born_country']]

                    name  height_cm born_country
5781      Tommy Burleson      223.0          USA
6722    Shaquille O'Neal      216.0          USA
6937      David Robinson      216.0          USA
82100      Frédéric Weis      218.0          FRA
123850    Tyson Chandler      216.0          USA
139365    Moustapha Fall      218.0          FRA

In [ ]:
#Filtering by string conditions
bios[bios['name'].str.contains('keith', case=False)] 
#case=False -> tidak membedakan besar kecilnya huruf
#.str.contains() -> mengecek sebuah string tertentu dalam setiap elemen series

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
...,...,...,...,...,...,...,...,...,...,...
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN
117676,119195,Duncan Keith,1983-07-16,Winnipeg,Manitoba,CAN,Canada,185.0,88.0,NaN
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN
127310,129749,Tracy Keith-Matchitt,1990-03-30,Palmerston North,Manawatu-Wanganui,NZL,Cook Islands,167.0,60.0,NaN

In [ ]:
#regex code (regular expression)
bios[bios['name'].str.contains('keith|patrick', case=False)] #'keith|patrick merupakan regex'

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143975,147633,Patrick Chinyemba,2001-01-03,NaN,NaN,NaN,Zambia,NaN,NaN,NaN
144172,147850,Patrick Jakob,1996-10-17,Sankt Johann in Tirol,Tirol,AUT,Austria,NaN,NaN,NaN
144547,148239,Patrick Galbraith,1986-03-11,Haderslev,Syddanmark,DEN,Denmark,NaN,NaN,NaN
144565,148257,Patrick Russell,1993-01-04,Gentofte,Hovedstaden,DEN,Denmark,186.0,93.0,NaN
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12

In [ ]:
#don't use regex search (exact match)
bios[bios['name'].str.contains('patrick', case=False, regex=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN
119,120,Patrick Wheatley,1899-01-20,Vryheid,KwaZulu-Natal,RSA,Great Britain,NaN,NaN,1967-11-05
319,320,Patrick De Koning,1961-04-23,Dendermonde,Oost-Vlaanderen,BEL,Belgium,178.0,92.0,NaN
2115,2125,Patrick Jopp,1962-01-08,NaN,NaN,NaN,Switzerland,176.0,67.0,NaN
2454,2465,Patrick Birocheau,1955-09-23,Béjaïa,Béjaïa,ALG,France,177.0,72.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143975,147633,Patrick Chinyemba,2001-01-03,NaN,NaN,NaN,Zambia,NaN,NaN,NaN
144172,147850,Patrick Jakob,1996-10-17,Sankt Johann in Tirol,Tirol,AUT,Austria,NaN,NaN,NaN
144547,148239,Patrick Galbraith,1986-03-11,Haderslev,Syddanmark,DEN,Denmark,NaN,NaN,NaN
144565,148257,Patrick Russell,1993-01-04,Gentofte,Hovedstaden,DEN,Denmark,186.0,93.0,NaN
145435,149158,Patrick Gasienica,1998-11-28,McHenry,Illinois,USA,United States,NaN,NaN,2023-06-12

In [ ]:
#isin method n startswith() -> startswith : digunakan untuk mencari string tertentu yg diawali dengan teks tertentu
bios[bios['born_country'].isin(['GBR', 'GER']) & bios['name'].str.lower().str.startswith('keith')]

#penggunaan str.endswith()
bios[bios['born_country'].isin(['GBR', 'GER']) & bios['name'].str.lower().str.endswith('wallace')] 
#str.lower() -> mengubah string yg berada dalam series menjadi huruf kecil semua, lalu dicocokkan

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22
14577,14674,Keith Harrison,1933-03-28,Birmingham,England,GBR,Great Britain,NaN,NaN,NaN
16166,16281,Keith Reynolds,1963-12-25,Solihull,England,GBR,Great Britain,173.0,68.0,NaN
18734,18862,Keith Sinclair,1945-06-26,Sunderland,England,GBR,Great Britain,190.0,79.0,NaN
29897,30123,Keith Langley,1961-06-03,Aldershot,England,GBR,Great Britain,173.0,70.0,NaN
34011,34275,Keith Remfry,1947-11-17,Ealing,England,GBR,Great Britain,193.0,114.0,2015-09-16
46885,47234,Keith Collin,1937-01-18,Marylebone,England,GBR,Great Britain,168.0,63.0,1991-03-06
55317,55712,Keith Boxell,1958-05-06,Clapham,England,GBR,Great Britain,170.0,87.0,NaN
57818,58226,Keith Peache,1947-08-10,Lewisham,England,GBR,Great Britain,180.0,98.0,NaN
61748,62202,Keith Grogono,1912-11-04,Stratford,England,GBR,Great Britain,NaN,NaN,1999-03-22
62620,63086,Keith Musto,1936-01-12,Rochford,England,GBR,Great Britain,174.0,72.0,NaN
68324,68841,Keith Angus,1943-04-05,Sheffield,England,GBR,Great Britain,170.0,59.0,NaN
68472,68989,Keith Cullen,1972-06-13,Ilford,England,GBR,Great Britain,177.0,61.0,NaN
68997,69514,Keith Stock,1957-03-18,Woolwich,England,GBR,Great Britain,176.0,73.0,NaN
95267,96037,Keith Oliver,1947-10-27,Liverpool,England,GBR,Great Britain,172.0,68.0,NaN
96452,97229,Keith Schellenberg,1929-03-13,Middlesbrough,England,GBR,Great Britain,NaN,NaN,2019-10-28

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31
17002,17120,Shaun Wallace,1961-11-20,Christchurch,England,GBR,Great Britain,173.0,73.0,NaN
42111,42434,Nigel Wallace,1967-06-05,Rochford,England,GBR,Great Britain,180.0,70.0,NaN
68289,68806,Andrea Wallace,1966-11-22,Northallerton,England,GBR,Great Britain,170.0,47.0,NaN
131290,134066,Dan Wallace,1993-04-14,Edinburgh,Scotland,GBR,Great Britain,188.0,80.0,NaN
134189,137224,Lloyd Wallace,1995-02-13,Southampton,England,GBR,Great Britain,179.0,NaN,NaN
139683,143160,Zach Wallace,1999-09-29,Redhill,England,GBR,Great Britain,NaN,NaN,NaN

In [64]:
#Query function -> Lebih mudah dibaca dan ringkas seperti SQL
bios.query('height_cm > 190 and weight_kg > 80 and born_country == "GBR"')

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1195,1202,Lennox Lewis,1965-09-02,West Ham,England,GBR,Canada,194.0,100.0,NaN
3344,3356,Henry Akinwande,1965-10-12,Dulwich,England,GBR,Great Britain,196.0,91.0,NaN
3424,3436,Paul Lawson,1966-12-02,London,England,GBR,Great Britain,193.0,91.0,NaN
3457,3469,Fola Okesola,1974-04-16,Greenwich,England,GBR,Great Britain,191.0,91.0,NaN
3497,3509,Dave Thomas,1937-08-29,London,England,GBR,Great Britain,193.0,91.0,1980-01-01
...,...,...,...,...,...,...,...,...,...,...
131694,134513,Jonty Evans,1971-10-04,Burton-on-Trent,England,GBR,Ireland,193.0,82.0,NaN
134174,137208,Nick Gleeson,1996-10-18,Epsom,England,GBR,Great Britain,193.0,106.0,NaN
134176,137210,Toby Olubi,1987-09-24,Camberwell,England,GBR,Great Britain,195.0,110.0,NaN
134178,137213,Thomas Muirhead,1995-04-11,Perth,Scotland,GBR,Great Britain,192.0,87.0,NaN
143782,147438,Ben Davison,1996-07-24,Durham,England,GBR,United States,193.0,87.0,NaN